Revit 2024 API
FabricationUtils Methods
The FabricationUtils type exposes the following members.
Methods
Name | Description
ExportToPCF
 Exports a list of fabrication parts into PCF format.
ValidateConnectivity
 Check if two connectors are valid to connect directly without couplings.
See Also
FabricationUtils Class
Autodesk.Revit.DB.Fabrication Namespace